tutorials/incompressibleFluid/impeller/system/createNonConformalCouplesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createNonConformalCouplesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nonConformalCouples
{
    nonConformalCoupleIn0
    {
        patches         (nonCoupleIn1 nonCoupleIn2);
        transform       none;
    }

    nonConformalCoupleIn30
    {
        $nonConformalCoupleIn0;
        transform       rotational;
        rotationAxis    (-1 0 0);
        rotationCentre  (0 0 0);
        rotationAngle   30;
    }

    nonConformalCoupleIn60 { $nonConformalCoupleIn30; rotationAngle 60; }
    nonConformalCoupleIn90 { $nonConformalCoupleIn30; rotationAngle 90; }
    nonConformalCoupleIn120 { $nonConformalCoupleIn30; rotationAngle 120; }
    nonConformalCoupleIn150 { $nonConformalCoupleIn30; rotationAngle 150; }
    nonConformalCoupleIn180 { $nonConformalCoupleIn30; rotationAngle 180; }
    nonConformalCoupleIn210 { $nonConformalCoupleIn30; rotationAngle 210; }
    nonConformalCoupleIn240 { $nonConformalCoupleIn30; rotationAngle 240; }
    nonConformalCoupleIn270 { $nonConformalCoupleIn30; rotationAngle 270; }
    nonConformalCoupleIn300 { $nonConformalCoupleIn30; rotationAngle 300; }
    nonConformalCoupleIn330 { $nonConformalCoupleIn30; rotationAngle 330; }

    nonConformalCoupleOut0
    {
        patches         (nonCoupleOut1 nonCoupleOut2);
        transform       none;
    }

    nonConformalCoupleOut30
    {
        patches         (nonCoupleOut1 nonCoupleOut2);
        transform       rotational;
        rotationAxis    (-1 0 0);
        rotationCentre  (0 0 0);
        rotationAngle   -30;
    }

    nonConformalCoupleOut60 { $nonConformalCoupleOut30; rotationAngle -60; }
    nonConformalCoupleOut90 { $nonConformalCoupleOut30; rotationAngle -90; }
    nonConformalCoupleOut120 { $nonConformalCoupleOut30; rotationAngle -120; }
    nonConformalCoupleOut150 { $nonConformalCoupleOut30; rotationAngle -150; }
    nonConformalCoupleOut180 { $nonConformalCoupleOut30; rotationAngle -180; }
    nonConformalCoupleOut210 { $nonConformalCoupleOut30; rotationAngle -210; }
    nonConformalCoupleOut240 { $nonConformalCoupleOut30; rotationAngle -240; }
    nonConformalCoupleOut270 { $nonConformalCoupleOut30; rotationAngle -270; }
    nonConformalCoupleOut300 { $nonConformalCoupleOut30; rotationAngle -300; }
    nonConformalCoupleOut330 { $nonConformalCoupleOut30; rotationAngle -330; }
}

// ************************************************************************* //
